var swiper = new Swiper(".mySwiper",{//สร้างตัวแปรชื่อ swiper เพื่อเก็บข้อมูลของ Swiper object//เรียกใช้ฟังก์ชัน new Swiper เพื่อสร้าง object ใหม่ของ Swiper
  effect : "coverflow",//เพื่อให้ปรับแต่การหมุนได้
  grabCursor : true,//เปลี่ยนเมาส์เป็นมือเวลาเลื่อนสไลด์
  centeredSlides : true,//จัดภาพสไลด์ให้ตรงกลาง(สำหรับเวลากำหนด slidesPerView เป็นเลขคู่)
  slidesPerView : "auto",//แสดงภาพสไลด์ทีละกี่ภาพ โดยคำนวณให้พอดีกับพื้นที่
  coverflowEffect : {//ปรับแต่ง effect แบบ coverflow(เทคนิคการแสดงภาพแบบ 3 มิติที่จำลองการพลิกใบไพ่ หรือการเลื่อนชั้นวางของ)
    rotate : 50,//องศาการหมุนของภาพสไลด์
    stretch : 0,//ปรับความยืดของภาพสไลด์ (0 = ไม่มีการยืด)
    depth :100,//ความลึกแบบ 3 มิติของภาพสไลด์ 100 pixel ภาพสไลด์ที่อยู่ด้านหน้าจะแสดงผลใหญ่กว่าภาพสไลด์ที่อยู่ด้านหลัง
    modifier :1,//เลื่อนแต่ละครั้งครั้งต้องการให้ภาพหมุนกี่ครั้ง(สัมพันธ์กับ rotate )
    slideShadows : true,//แสดงเงาของภาพสไลด์
  },
  pagination: {
    el: ".swiper-pagination",//สร้างจุดแสดงสถานะของสไลด์ ไปยัง element ที่มี class "swiper-pagination"
  },
  loop: true, 
});

particlesJS("particles-js", {//สร้างอนิเมชั่น (particlesJS)
  "particles": {//กำหนดลักษณะของอนิเมชั่น
    "number": {//จำนวนของอนิเมชั่น
      "value": 200,//จำนวนอนิเมชั่นเริ่มต้นคือ 200 ชิ้น
      "density": {//ความหนาแน่นของอนิเมชั่น
        "enable": true,//เปิดใช้งานการปรับความหนาแน่น
        "value_area": 800//ปรับความหนาแน่นของอนิเมชั่นภายในพื้นที่ 800
      }
    },
    "color": {//กำหนดสีของอนิเมชั่นเป็น #f0c394 (สีส้มอ่อน)
      "value": "#f0c394"
    },
    
    "opacity": {//ความทึบของอนิเมชั่น
      "value": 0.4,//ค่าความทึบเริ่มต้นคือ 0.4 (โปร่งใส 40%)
      "random": false,//true: ค่าความโปร่งใสของอนิเมชั่นแต่ละชิ้นจะแตกต่างกันแบบสุ่ม false: ค่าความโปร่งใสของอนิเมชั่นทุกชิ้นเท่ากัน (ตามค่าที่กำหนดใน value)
      "anim": {//การเปลี่ยนแปลงความโปร่งใสของอนิเมชั่น
        "enable": false,//true: ค่าความโปร่งใสของอนิเมชั่นจะมีการเปลี่ยนแปลงไปตามค่าที่กำหนด //false: ค่าความโปร่งใสของอนิเมชั่นคงที่ (ตามค่าที่กำหนดใน value)
        "speed": 1,//ความเร็วในการเปลี่ยนแปลงความโปร่งใส
        "opacity_min": 0.1,//ค่าความโปร่งใสขั้นต่ำ
        "sync": false //กำหนดให้ค่าความโปร่งใสของอนิเมชั่นทั้งหมดเปลี่ยนแปลงพร้อมกัน true: ทุกชิ้นเปลี่ยนแปลงพร้อมกัน //false: แต่ละชิ้นเปลี่ยนแปลงแบบอิสระ
      }
    },
    "size": {//ขนาดของอนิเมชั่น
      "value": 3,// ขนาดเริ่มต้นคือ 3 pixel
      "random": true,//true: ขนาดของอนิเมชั่นแต่ละชิ้นจะแตกต่างกันไปแบบสุ่ม //false: ขนาดของอนิเมชั่นทุกชิ้นเท่ากัน (ตามค่าที่กำหนดใน value)
      "anim": {//การเปลี่ยนแปลงขนาดของอนิเมชั่น
        "enable": false,//true: ขนาดของอนิเมชั่นจะมีการเปลี่ยนแปลงไปตามค่าที่กำหนด //false: ขนาดของอนิเมชั่นคงที่ (ตามค่าที่กำหนดใน value)
        "speed": 40,//speed: ความเร็วในการเปลี่ยนแปลงขนาด
        "size_min": 0.1,//ขนาดอนิเมชั่นขั้นต่ำ
        "sync": false //true: ทุกชิ้นเปลี่ยนแปลงพร้อมกัน //false: แต่ละชิ้นเปลี่ยนแปลงแบบอิสระ
      }
    },
    "line_linked": {//การเชื่อมโยงระหว่างอนิเมชั่น
      "enable": true,//เปิดใช้งานการเชื่อมโยง
      "distance": 150,//ระยะห่างในการเชื่อมโยง
      "color": "#f0c394",//สีของเส้นเชื่อมโยง
      "opacity": 0.4,//ค่าความทึบคือ 0.4 (โปร่งใส 40%)
      "width": 1//ความหนาของเส้นเชื่อมโยง (1 pixel)
    },
    "move": {
      "enable": true,//เปิดใช้งาน/ปิดใช้งานการเคลื่อนที่
      "speed": .9,//ความเร็วในการเคลื่อนที่
      "direction": "none",//เคลื่อนที่แบบสุ่ม ตัวเลือกอื่นๆ: "horizontal", "vertical", "bottom-top", "top-bottom", "left-right", "right-left"
      "random": false,//TRUEสุ่มทิศทางการเคลื่อนที่ FALSEเคลื่อนที่ตามทิศทางที่กำหนด (direction)
      "straight": false,//true: เคลื่อนที่เป็นเส้นตรง false: เคลื่อนที่แบบโค้ง
      "out_mode": "out",//กำหนดลักษณะ when อนิเมชั่น "particles" เคลื่อนที่ออกนอกขอบของหน้าจอ "out": หายไป "bounce": เด้งกลับมา "none": เฉื่อย
      "bounce": false,//เด้งกลับมา when อนิเมชั่น "particles" เคลื่อนที่ชนขอบของหน้าจอ
      "attract": {//กำหนดแรงดึงดูดระหว่างอนิเมชั่น "particles"
        "enable": false,//ปิดใช้งานแรงดึงดูด
        "rotateX": 600,//หมุนตามแกน X 
        "rotateY": 1200//หมุนตามแกน Y 
      }
    }
  },

  "retina_detect": true//อนิเมชั่น "particles" จะแสดงผลได้คมชัดและมีขนาดที่เหมาะสมบนหน้าจอ Retina Retina คือหน้าจอที่มีความละเอียดสูงกว่าปกติ
});





